# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [[-1, 6], 1, SpatialAlignTransnormer, [512, 512, 16, True]] # cat backbone P4 (11) -1: high, 6: low
  - [-1, 3, C2fCIB, [512, True]] # 12

  - [[-1, 4], 1, SpatialAlignTransnormer, [256, 512, 8, False]] # cat backbone P3 (13) -1: high, 4: low
  - [-1, 3, C2f, [256]] # 14 (P3/8-small) (low)

  - [[-1, 12], 1, BUSpatialAlignTransnormer, [256, 512, 8, True]] # -1: low, 12: high
  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # cat head P4 (17)
  - [-1, 3, C2fCIB, [512, True]] # 18 (P4/16-medium)

  - [[-1, 10], 1, BUSpatialAlignTransnormer, [512, 512, 16, False]] # (19)
  - [-1, 1, SCDown, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # cat head P5 (21)
  - [-1, 3, C2fCIB, [1024, True]] # 22 (P5/32-large)

  - [[14, 18, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
